# Pandas DataFrame
[Build a DataFrame](#build) | 
[Explore a DataFrame](#explore) | 
[Select elements of the DataFrame](#select) | 
[Remove column](#remove) | 
[Add a column](#addCol) | 
[Remove a row](#removeRow) | 
[Add a row](#addRow) | 
[Sorting](#sort) | 
[Applying functions to all (or subsets) of a DataFrame](#apply)

As mentioned in class, we will use the standard Pandas DataFrame commands rather than those proposed by the data8 book.
In addition to the guide provided here you can find good tutorials on Pandas DataFrames at [tutorial point](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm) and on the [Pandas official site](https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#dataframe)

In [218]:
import pandas as pd

## Build a DataFrame <a name = "build"></a>
There are several ways to buid DataFrames. For the time being, we will only consider one.

In [219]:
# Constructing dataFrame from a data structure (dictionary)
# Note that the elements in the dictionary must have the same length
cs1040={'year':[2016, 2016, 2017, 2017, 2018, 2018, 2019],
        'semester': ['Spring', 'fall', 'Spring', 'fall', 'Spring', 'fall', 'Spring'],
        'avg_grade': [3.0, 3.4, 3.2, 3.1, 3.4, 3.0, 3.5]}
cs1040_df = pd.DataFrame(data=cs1040)
cs1040_df

   year semester  avg_grade
0  2016   Spring        3.0
1  2016     fall        3.4
2  2017   Spring        3.2
3  2017     fall        3.1
4  2018   Spring        3.4
5  2018     fall        3.0
6  2019   Spring        3.5

In [220]:
# Note that in the example above I did not define an index, so an index is defined automatically (the numbers 0, 1, 2, 3, ...)
# One can, however define an index
players = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data=players, index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [221]:
# You can also create an empty DataFrame:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

## Explore a DataFrame <a name="explore"></a>

In [222]:
# looking at the beginning of the dataFrame
cs1040_df.head(2)

   year semester  avg_grade
0  2016   Spring        3.0
1  2016     fall        3.4

In [223]:
# looking at the end of the dataFrame
cs1040_df.tail()

   year semester  avg_grade
2  2017   Spring        3.2
3  2017     fall        3.1
4  2018   Spring        3.4
5  2018     fall        3.0
6  2019   Spring        3.5

In [224]:
# descriptive statistics for numerical columns
cs1040_df.describe()

              year  avg_grade
count     7.000000   7.000000
mean   2017.285714   3.228571
std       1.112697   0.205866
min    2016.000000   3.000000
25%    2016.500000   3.050000
50%    2017.000000   3.200000
75%    2018.000000   3.400000
max    2019.000000   3.500000

# Select elements of the DataFrame <a name="select"></a>

In [225]:
# Select one column
cs1040_df['avg_grade']

0    3.0
1    3.4
2    3.2
3    3.1
4    3.4
5    3.0
6    3.5
Name: avg_grade, dtype: float64

In [226]:
# Select several columns
cs1040_df[['avg_grade','year']]

   avg_grade  year
0        3.0  2016
1        3.4  2016
2        3.2  2017
3        3.1  2017
4        3.4  2018
5        3.0  2018
6        3.5  2019

In [227]:
# Select a set of consecutive rows (slice)
cs1040_df[2:6]

   year semester  avg_grade
2  2017   Spring        3.2
3  2017     fall        3.1
4  2018   Spring        3.4
5  2018     fall        3.0

In [228]:
# Select all the rows that have "Spring" as the semester value (filter)
cs1040_df[cs1040_df['semester']=="Spring"]

   year semester  avg_grade
0  2016   Spring        3.0
2  2017   Spring        3.2
4  2018   Spring        3.4
6  2019   Spring        3.5

In [229]:
# Another filter example
cs1040_df[cs1040_df['avg_grade']> 3.2]

   year semester  avg_grade
1  2016     fall        3.4
4  2018   Spring        3.4
6  2019   Spring        3.5

In [230]:
# Another way to select all the rows that have "Spring" as the semester value
#
# Two steps:
# First index the table with the semester column
# And then locate those semesters that have value "Spring"
#
# this is how a table with the semester column as an index looks like
cs1040_df.set_index('semester')

          year  avg_grade
semester
Spring    2016        3.0
fall      2016        3.4
Spring    2017        3.2
fall      2017        3.1
Spring    2018        3.4
fall      2018        3.0
Spring    2019        3.5

In [231]:
# Here I create a new table that has the semester colum as an index
# and then locate the rows that have "Spring" as the semester value
cs1040_df_indexed=cs1040_df.set_index('semester')
cs1040_df_indexed.loc['Spring']

          year  avg_grade
semester
Spring    2016        3.0
Spring    2017        3.2
Spring    2018        3.4
Spring    2019        3.5

In [232]:
# note that both tables are unchanged
print(cs1040_df_indexed, '\r', cs1040_df)

          year  avg_grade
semester
Spring    2016        3.0
fall      2016        3.4
Spring    2017        3.2
fall      2017        3.1
Spring    2018        3.4
fall      2018        3.0
    year semester  avg_grade
0  2016   Spring        3.0
1  2016     fall        3.4
2  2017   Spring        3.2
3  2017     fall        3.1
4  2018   Spring        3.4
5  2018     fall        3.0
6  2019   Spring        3.5

## Remove column <a name="remove"></a>

In [233]:
# remove one column
cs1040_df.drop(['year'],axis=1)

  semester  avg_grade
0   Spring        3.0
1     fall        3.4
2   Spring        3.2
3     fall        3.1
4   Spring        3.4
5     fall        3.0
6   Spring        3.5

In [234]:
cs1040_df

   year semester  avg_grade
0  2016   Spring        3.0
1  2016     fall        3.4
2  2017   Spring        3.2
3  2017     fall        3.1
4  2018   Spring        3.4
5  2018     fall        3.0
6  2019   Spring        3.5

#### You can also delete a column using the *del* function

del cs1040_df\['year'\]

#### or using the *pop* function

cs1040_df.pop('year')

## Add a column <a name = "addCol"></a>

In [235]:
# You can assign values directly
cs1040_df['Num of students']=[10,12,11,9,17,14,20]
cs1040_df

   year semester  avg_grade  Num of students
0  2016   Spring        3.0               10
1  2016     fall        3.4               12
2  2017   Spring        3.2               11
3  2017     fall        3.1                9
4  2018   Spring        3.4               17
5  2018     fall        3.0               14
6  2019   Spring        3.5               20

In [236]:
# Or you can calculate values
cs1040_df['%grade']=cs1040_df['avg_grade']/4*100
cs1040_df

   year semester  avg_grade  Num of students  %grade
0  2016   Spring        3.0               10    75.0
1  2016     fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5

## Remove a row <a name="removeRow"></a>

In [237]:
cs1040_df.drop(6)

   year semester  avg_grade  Num of students  %grade
0  2016   Spring        3.0               10    75.0
1  2016     fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     fall        3.0               14    75.0

## Add a row <a name="addRow"></a>

In [238]:
myrow = {'year':[2015], 'semester':['Spring'], 'avg_grade':[4.0], 'Num of students':[18], '%grade':[100]}
df = pd.DataFrame(data=myrow)
cs1040_df=cs1040_df.append(df)
cs1040_df

   year semester  avg_grade  Num of students  %grade
0  2016   Spring        3.0               10    75.0
1  2016     fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5
0  2015   Spring        4.0               18   100.0

In [239]:
# note the repeated labels
# This still works
cs1040_df[5:8]

   year semester  avg_grade  Num of students  %grade
5  2018     fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5
0  2015   Spring        4.0               18   100.0

In [240]:
# also this works
cs1040_df[0:2]

   year semester  avg_grade  Num of students  %grade
0  2016   Spring        3.0               10    75.0
1  2016     fall        3.4               12    85.0

In [241]:
# However if I remove the row with label 0, more than one row will be removed
cs1040_df=cs1040_df.drop(0)
cs1040_df

   year semester  avg_grade  Num of students  %grade
1  2016     fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5

## Sorting <a name="sort"></a>

In [242]:
# tables can be sorted on the value of columns or rows
cs1040_df.sort_values(by=['avg_grade'],axis=0)

   year semester  avg_grade  Num of students  %grade
5  2018     fall        3.0               14    75.0
3  2017     fall        3.1                9    77.5
2  2017   Spring        3.2               11    80.0
1  2016     fall        3.4               12    85.0
4  2018   Spring        3.4               17    85.0
6  2019   Spring        3.5               20    87.5

In [243]:
# also descending
cs1040_df.sort_values(by=['avg_grade'],axis=0, ascending=False)

   year semester  avg_grade  Num of students  %grade
6  2019   Spring        3.5               20    87.5
1  2016     fall        3.4               12    85.0
4  2018   Spring        3.4               17    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
5  2018     fall        3.0               14    75.0

In [244]:
# also along multiple rows or colums
cs1040_df.sort_values(by=['semester','avg_grade'],axis=0)

   year semester  avg_grade  Num of students  %grade
2  2017   Spring        3.2               11    80.0
4  2018   Spring        3.4               17    85.0
6  2019   Spring        3.5               20    87.5
5  2018     fall        3.0               14    75.0
3  2017     fall        3.1                9    77.5
1  2016     fall        3.4               12    85.0

## Applying functions to all (or subsets) of a DataFrame <a name="apply"></a>

Note the wrong order of the semester column above 
It is due to the capital S of Spring (capital letters come before lower case in utf_8)
So, I would like to capitalize all of the elements in the column semester.

In Python there are [several methods](https://docs.python.org/3/library/stdtypes.html#index-30) that allow to manipulate strings, we will use the *capitalize* method

Below is a simple example

In [245]:
a = "hello"
a.capitalize()

'Hello'

Now I can apply the capitalize method to all elements of the semester column

In [246]:
cs1040_df['semester'].str.capitalize()

1      Fall
2    Spring
3      Fall
4    Spring
5      Fall
6    Spring
Name: semester, dtype: object

In [247]:
# At this point however, my table hasn't changed
cs1040_df

   year semester  avg_grade  Num of students  %grade
1  2016     fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5

## In order to change the DataFrame: assign the result of the operation back to the DataFrame

What we want to say is something to the effect of "assign to the column *semester* of the data frame the result of the capitalize operation". For example: 
#cs1040_df['semester'] = cs1040_df['semester'].str.capitalize()

This syntax however would generate a warning (more details [here](http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html))

Below is the correct assignment.

In [ ]:
# simple syntax that generates a warning 
#cs1040_df['semester'] = cs1040_df['semester'].str.capitalize()

# Correct syntax
cs1040_df.loc[:,['semester']] = cs1040_df['semester'].str.capitalize()
cs1040_df

In [248]:
# AN ALTERNATIVE WAY TO APPLY FUNCTIONS TO MULTIPLE ELEMENTS IN TABLES (LAMBDA FUNCTIONS)
#     ***  REMOVE PREVIOUS RUNS TO TEST

capitalizer = lambda x: x.capitalize()
cs1040_df.loc[:,['semester']]=cs1040_df['semester'].apply(capitalizer)

In [249]:
cs1040_df

   year semester  avg_grade  Num of students  %grade
1  2016     Fall        3.4               12    85.0
2  2017   Spring        3.2               11    80.0
3  2017     Fall        3.1                9    77.5
4  2018   Spring        3.4               17    85.0
5  2018     Fall        3.0               14    75.0
6  2019   Spring        3.5               20    87.5

In [250]:
cs1040_df.sort_values(by=['semester'],axis=0)

   year semester  avg_grade  Num of students  %grade
1  2016     Fall        3.4               12    85.0
3  2017     Fall        3.1                9    77.5
5  2018     Fall        3.0               14    75.0
2  2017   Spring        3.2               11    80.0
4  2018   Spring        3.4               17    85.0
6  2019   Spring        3.5               20    87.5